
## Plan Result (tiny_virtual_machines)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.tiny_virtual_machines[&#34;bunkerweb-test&#34;].proxmox_virtual_environment_file.cloud_config
  * module.tiny_virtual_machines[&#34;bunkerweb-test&#34;].proxmox_virtual_environment_vm.vm


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.tiny_virtual_machines["bunkerweb-test"].proxmox_virtual_environment_file.cloud_config will be created
  + resource "proxmox_virtual_environment_file" "cloud_config" {
      + content_type           = "snippets"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "loki"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = (sensitive value)
          + file_name = "bunkerweb-test-cloud-config.yaml"
          + resize    = 0
        }
    }

  # module.tiny_virtual_machines["bunkerweb-test"].proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "BunkerWeb Test VM"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "bunkerweb-test"
      + network_interface_names = (known after apply)
      + node_name               = "loki"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 301

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + architecture = "x86_64"
          + cores        = 1
          + hotplugged   = 0
          + limit        = 0
          + numa         = false
          + sockets      = 1
          + type         = "host"
          + units        = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "on"
          + file_format       = (known after apply)
          + file_id           = "local:iso/jammy-server-cloudimg-amd64.img"
          + interface         = "virtio0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 8
          + ssd               = false
        }

      + initialization {
          + datastore_id      = "local-lvm"
          + upgrade           = (known after apply)
          + user_data_file_id = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "10.151.14.201/24"
                  + gateway = "10.151.14.1"
                }
            }
        }

      + memory {
          + dedicated      = 4096
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + startup {
          + down_delay = -1
          + order      = 1
          + up_delay   = 1
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.tiny_virtual_machines["npm-test"].proxmox_virtual_environment_vm.vm has changed
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "300"
      ~ mac_addresses           = [
            # (1 unchanged element hidden)
            "BC:24:11:5D:E9:1B",
          + "02:42:EF:D6:79:51",
          + "02:42:E0:39:3B:56",
          + "02:42:CE:F7:8E:95",
          + "5E:17:25:DC:31:49",
          + "A6:7A:5A:52:E3:EE",
          + "22:D0:04:F2:57:7C",
        ]
        name                    = "npm-test"
        tags                    = [
            "terraform",
        ]
        # (28 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":418,"Program":"tfcmt","SHA1":"","Target":"tiny_virtual_machines","Vars":{}} -->